{
  "@context": {
    "xsd": "http://www.w3.org/2001/XMLSchema#",
    "description": {
      "@id": "https://schema.org/description",
      "@container": "@language"
    }
  },
  "@id": "https://raw.githubusercontent.com/Prometheus-X-association/reference-models/main/src/references/building-block/edgeComputingAIProcessing.json",
  "title": {
    "@type": "xsd:string",
    "@value": "Edge computing - AI processing"
  },
  "description": [
    {
      "@language": "@en",
      "@value": "Provides value added services exploiting an underlying distributed edge computing infrastructure (e.g. owned and operated by Cloud Providers). Two main high level objectives are targeted by these services: - privacy preserving: keep the data close to the user, more exactly within a pre-defined privacy zone. - efficient near-data processing: optimize performance and resource utilization The main goal is to move the processing functions close to the data, and execute them on-site. If the execution capability is available in the node storing the data, the processing function (FaaS based operation) or container (CaaS based operation) is launched there (e.g. by the Kubernetes/Knative platform). By these means, we can avoid the transmission of a large amount of data."
    }
  ],
  "summary": [],
  "functionalities": [
    {
      "@type": "xsd:string",
      "@value": "Must have access to infrastructure (of e.g. a Cloud Provider or private one)"
    },
    {
      "@type": "xsd:string",
      "@value": "Must be able to deploy (and start/stop/destroy) a Kubernetes cluster to Cloud Provider's infrastructure via IaaS offering"
    },
    {
      "@type": "xsd:string",
      "@value": "Must be able to manage its Kubernetes cluster(s)"
    },
    {
      "@type": "xsd:string",
      "@value": "Might have access to managed Kubernetes cluster of Cloud Provider"
    },
    {
      "@type": "xsd:string",
      "@value": "Must be able to configure CNI plugins of Kubernetes and Istio service mesh"
    },
    {
      "@type": "xsd:string",
      "@value": "Must be able to move data of Data Provider to given node of its Kubernetes cluster making use of Connector BB"
    },
    {
      "@type": "xsd:string",
      "@value": "Must support Container-as-a-Service OR Function-as-a-Service based operation"
    },
    {
      "@type": "xsd:string",
      "@value": "Must support privacy-aware scheduling in its Kubernetes cluster "
    },
    {
      "@type": "xsd:string",
      "@value": "Must support data-availability-aware scheduling in its Kubernetes cluster "
    },
    {
      "@type": "xsd:string",
      "@value": "Must support privacy preserving data sharing among nodes"
    },
    {
      "@type": "xsd:string",
      "@value": "Should provide access to an application agnostic FL platform for BB-1"
    },
    {
      "@type": "xsd:string",
      "@value": "Should provide FaaS (or CaaS) APIs to data processing/assurance BBs"
    }
  ],
  "standards": [],
  "implementations": [
    {
      "@type": "xsd:anyURI",
      "@value": "https://dataspace.prometheus-x.org/building-blocks/decentralized-ai/decentralized-ai-processing"
    }
  ]
}
